icboredman/TeensyCam-SW/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT4_FTM1CH0SRC_FTM 0x00u /*!<@brief FTM1 channel 0 input capture source select: FTM1_CH0 signal */

/*! @name PORTA12 (number 64), SYSCLK
  @{ */
#define BOARD_INITPINS_SYSCLK_PERIPHERAL FTM1                    /*!<@brief Device name: FTM1 */
#define BOARD_INITPINS_SYSCLK_SIGNAL CH                          /*!<@brief FTM1 signal: CH */
#define BOARD_INITPINS_SYSCLK_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_SYSCLK_PIN 12U                            /*!<@brief PORTA pin index: 12 */
#define BOARD_INITPINS_SYSCLK_CHANNEL 0                          /*!<@brief FTM1 channel: 0 */
#define BOARD_INITPINS_SYSCLK_PIN_NAME FTM1_CH0                  /*!<@brief Pin name */
#define BOARD_INITPINS_SYSCLK_LABEL "SYSCLK"                     /*!<@brief Label */
#define BOARD_INITPINS_SYSCLK_NAME "SYSCLK"                      /*!<@brief Identifier name */
#define BOARD_INITPINS_SYSCLK_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTB2 (number 83), SCL
  @{ */
#define BOARD_INITPINS_SCL_PERIPHERAL I2C0   /*!<@brief Device name: I2C0 */
#define BOARD_INITPINS_SCL_SIGNAL SCL        /*!<@brief I2C0 signal: SCL */
#define BOARD_INITPINS_SCL_PORT PORTB        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_SCL_PIN 2U            /*!<@brief PORTB pin index: 2 */
#define BOARD_INITPINS_SCL_PIN_NAME I2C0_SCL /*!<@brief Pin name */
#define BOARD_INITPINS_SCL_LABEL "SCL"       /*!<@brief Label */
#define BOARD_INITPINS_SCL_NAME "SCL"        /*!<@brief Identifier name */
                                             /* @} */

/*! @name PORTB3 (number 84), SDA
  @{ */
#define BOARD_INITPINS_SDA_PERIPHERAL I2C0   /*!<@brief Device name: I2C0 */
#define BOARD_INITPINS_SDA_SIGNAL SDA        /*!<@brief I2C0 signal: SDA */
#define BOARD_INITPINS_SDA_PORT PORTB        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_SDA_PIN 3U            /*!<@brief PORTB pin index: 3 */
#define BOARD_INITPINS_SDA_PIN_NAME I2C0_SDA /*!<@brief Pin name */
#define BOARD_INITPINS_SDA_LABEL "SDA"       /*!<@brief Label */
#define BOARD_INITPINS_SDA_NAME "SDA"        /*!<@brief Identifier name */
                                             /* @} */

/*! @name PORTB16 (number 95), STANDBY
  @{ */
#define BOARD_INITPINS_STANDBY_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_STANDBY_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_STANDBY_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_STANDBY_GPIO_PIN 16U                       /*!<@brief PORTB pin index: 16 */
#define BOARD_INITPINS_STANDBY_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_STANDBY_PIN 16U                            /*!<@brief PORTB pin index: 16 */
#define BOARD_INITPINS_STANDBY_CHANNEL 16                         /*!<@brief GPIOB GPIO channel: 16 */
#define BOARD_INITPINS_STANDBY_PIN_NAME PTB16                     /*!<@brief Pin name */
#define BOARD_INITPINS_STANDBY_LABEL "STANDBY"                    /*!<@brief Label */
#define BOARD_INITPINS_STANDBY_NAME "STANDBY"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_STANDBY_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTC0 (number 103), PTC0
  @{ */
#define BOARD_INITPINS_PTC0_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC0_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC0_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC0_GPIO_PIN 0U                       /*!<@brief PORTC pin index: 0 */
#define BOARD_INITPINS_PTC0_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC0_PIN 0U                            /*!<@brief PORTC pin index: 0 */
#define BOARD_INITPINS_PTC0_CHANNEL 0                         /*!<@brief GPIOC GPIO channel: 0 */
#define BOARD_INITPINS_PTC0_PIN_NAME PTC0                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC0_LABEL "PTC0"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC0_NAME "PTC0"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC0_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC1 (number 104), PTC1
  @{ */
#define BOARD_INITPINS_PTC1_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC1_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC1_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC1_GPIO_PIN 1U                       /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_PTC1_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC1_PIN 1U                            /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_PTC1_CHANNEL 1                         /*!<@brief GPIOC GPIO channel: 1 */
#define BOARD_INITPINS_PTC1_PIN_NAME PTC1                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC1_LABEL "PTC1"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC1_NAME "PTC1"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC2 (number 105), PTC2
  @{ */
#define BOARD_INITPINS_PTC2_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC2_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC2_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC2_GPIO_PIN 2U                       /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_PTC2_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC2_PIN 2U                            /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_PTC2_CHANNEL 2                         /*!<@brief GPIOC GPIO channel: 2 */
#define BOARD_INITPINS_PTC2_PIN_NAME PTC2                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC2_LABEL "PTC2"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC2_NAME "PTC2"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

