icboredman/TeensyCam-SW/board/pin_mux.h
/*! @name PORTC3 (number 106), PTC3
  @{ */
#define BOARD_INITPINS_PTC3_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC3_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC3_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC3_GPIO_PIN 3U                       /*!<@brief PORTC pin index: 3 */
#define BOARD_INITPINS_PTC3_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC3_PIN 3U                            /*!<@brief PORTC pin index: 3 */
#define BOARD_INITPINS_PTC3_CHANNEL 3                         /*!<@brief GPIOC GPIO channel: 3 */
#define BOARD_INITPINS_PTC3_PIN_NAME PTC3                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC3_LABEL "PTC3"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC3_NAME "PTC3"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC4 (number 109), PTC4
  @{ */
#define BOARD_INITPINS_PTC4_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC4_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC4_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC4_GPIO_PIN 4U                       /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_PTC4_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC4_PIN 4U                            /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_PTC4_CHANNEL 4                         /*!<@brief GPIOC GPIO channel: 4 */
#define BOARD_INITPINS_PTC4_PIN_NAME PTC4                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC4_LABEL "PTC4"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC4_NAME "PTC4"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC4_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC5 (number 110), PTC5
  @{ */
#define BOARD_INITPINS_PTC5_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC5_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC5_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC5_GPIO_PIN 5U                       /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_PTC5_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC5_PIN 5U                            /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_PTC5_CHANNEL 5                         /*!<@brief GPIOC GPIO channel: 5 */
#define BOARD_INITPINS_PTC5_PIN_NAME PTC5                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC5_LABEL "PTC5"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC5_NAME "PTC5"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC5_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC6 (number 111), PTC6
  @{ */
#define BOARD_INITPINS_PTC6_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC6_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC6_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC6_GPIO_PIN 6U                       /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_PTC6_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC6_PIN 6U                            /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_PTC6_CHANNEL 6                         /*!<@brief GPIOC GPIO channel: 6 */
#define BOARD_INITPINS_PTC6_PIN_NAME PTC6                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC6_LABEL "PTC6"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC6_NAME "PTC6"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC6_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC7 (number 112), PTC7
  @{ */
#define BOARD_INITPINS_PTC7_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC7_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC7_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC7_GPIO_PIN 7U                       /*!<@brief PORTC pin index: 7 */
#define BOARD_INITPINS_PTC7_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC7_PIN 7U                            /*!<@brief PORTC pin index: 7 */
#define BOARD_INITPINS_PTC7_CHANNEL 7                         /*!<@brief GPIOC GPIO channel: 7 */
#define BOARD_INITPINS_PTC7_PIN_NAME PTC7                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC7_LABEL "PTC7"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC7_NAME "PTC7"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC7_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC8 (number 113), PTC8
  @{ */
#define BOARD_INITPINS_PTC8_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC8_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC8_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC8_GPIO_PIN 8U                       /*!<@brief PORTC pin index: 8 */
#define BOARD_INITPINS_PTC8_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC8_PIN 8U                            /*!<@brief PORTC pin index: 8 */
#define BOARD_INITPINS_PTC8_CHANNEL 8                         /*!<@brief GPIOC GPIO channel: 8 */
#define BOARD_INITPINS_PTC8_PIN_NAME PTC8                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC8_LABEL "PTC8"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC8_NAME "PTC8"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC8_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC9 (number 114), PTC9
  @{ */
#define BOARD_INITPINS_PTC9_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC9_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC9_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC9_GPIO_PIN 9U                       /*!<@brief PORTC pin index: 9 */
#define BOARD_INITPINS_PTC9_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC9_PIN 9U                            /*!<@brief PORTC pin index: 9 */
#define BOARD_INITPINS_PTC9_CHANNEL 9                         /*!<@brief GPIOC GPIO channel: 9 */
#define BOARD_INITPINS_PTC9_PIN_NAME PTC9                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTC9_LABEL "PTC9"                      /*!<@brief Label */
#define BOARD_INITPINS_PTC9_NAME "PTC9"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC9_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTC10 (number 115), PTC10
  @{ */
#define BOARD_INITPINS_PTC10_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC10_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC10_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC10_GPIO_PIN 10U                      /*!<@brief PORTC pin index: 10 */
#define BOARD_INITPINS_PTC10_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC10_PIN 10U                           /*!<@brief PORTC pin index: 10 */
#define BOARD_INITPINS_PTC10_CHANNEL 10                        /*!<@brief GPIOC GPIO channel: 10 */
#define BOARD_INITPINS_PTC10_PIN_NAME PTC10                    /*!<@brief Pin name */
#define BOARD_INITPINS_PTC10_LABEL "PTC10"                     /*!<@brief Label */
#define BOARD_INITPINS_PTC10_NAME "PTC10"                      /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC10_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                               /* @} */

/*! @name PORTC11 (number 116), PTC11
  @{ */
#define BOARD_INITPINS_PTC11_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_PTC11_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_PTC11_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_PTC11_GPIO_PIN 11U                      /*!<@brief PORTC pin index: 11 */
#define BOARD_INITPINS_PTC11_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_PTC11_PIN 11U                           /*!<@brief PORTC pin index: 11 */
#define BOARD_INITPINS_PTC11_CHANNEL 11                        /*!<@brief GPIOC GPIO channel: 11 */
#define BOARD_INITPINS_PTC11_PIN_NAME PTC11                    /*!<@brief Pin name */
#define BOARD_INITPINS_PTC11_LABEL "PTC11"                     /*!<@brief Label */
#define BOARD_INITPINS_PTC11_NAME "PTC11"                      /*!<@brief Identifier name */
#define BOARD_INITPINS_PTC11_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                               /* @} */

/*! @name PORTD0 (number 127), PTD0
  @{ */
#define BOARD_INITPINS_PTD0_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD0_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD0_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD0_GPIO_PIN 0U                       /*!<@brief PORTD pin index: 0 */
#define BOARD_INITPINS_PTD0_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD0_PIN 0U                            /*!<@brief PORTD pin index: 0 */
#define BOARD_INITPINS_PTD0_CHANNEL 0                         /*!<@brief GPIOD GPIO channel: 0 */
#define BOARD_INITPINS_PTD0_PIN_NAME PTD0                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD0_LABEL "PTD0"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD0_NAME "PTD0"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD0_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD1 (number 128), PTD1
  @{ */
#define BOARD_INITPINS_PTD1_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD1_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD1_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD1_GPIO_PIN 1U                       /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_PTD1_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD1_PIN 1U                            /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_PTD1_CHANNEL 1                         /*!<@brief GPIOD GPIO channel: 1 */
#define BOARD_INITPINS_PTD1_PIN_NAME PTD1                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD1_LABEL "PTD1"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD1_NAME "PTD1"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD2 (number 129), PTD2
  @{ */
#define BOARD_INITPINS_PTD2_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD2_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD2_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD2_GPIO_PIN 2U                       /*!<@brief PORTD pin index: 2 */
#define BOARD_INITPINS_PTD2_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD2_PIN 2U                            /*!<@brief PORTD pin index: 2 */
#define BOARD_INITPINS_PTD2_CHANNEL 2                         /*!<@brief GPIOD GPIO channel: 2 */
#define BOARD_INITPINS_PTD2_PIN_NAME PTD2                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD2_LABEL "PTD2"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD2_NAME "PTD2"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD3 (number 130), PTD3
  @{ */
#define BOARD_INITPINS_PTD3_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD3_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD3_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD3_GPIO_PIN 3U                       /*!<@brief PORTD pin index: 3 */
#define BOARD_INITPINS_PTD3_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD3_PIN 3U                            /*!<@brief PORTD pin index: 3 */
#define BOARD_INITPINS_PTD3_CHANNEL 3                         /*!<@brief GPIOD GPIO channel: 3 */
#define BOARD_INITPINS_PTD3_PIN_NAME PTD3                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD3_LABEL "PTD3"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD3_NAME "PTD3"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD4 (number 131), PTD4
  @{ */
#define BOARD_INITPINS_PTD4_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD4_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD4_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD4_GPIO_PIN 4U                       /*!<@brief PORTD pin index: 4 */
#define BOARD_INITPINS_PTD4_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD4_PIN 4U                            /*!<@brief PORTD pin index: 4 */
#define BOARD_INITPINS_PTD4_CHANNEL 4                         /*!<@brief GPIOD GPIO channel: 4 */
#define BOARD_INITPINS_PTD4_PIN_NAME PTD4                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD4_LABEL "PTD4"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD4_NAME "PTD4"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD4_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

