icboredman/TeensyCam-SW/board/pin_mux.h
/*! @name PORTD5 (number 132), PTD5
  @{ */
#define BOARD_INITPINS_PTD5_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD5_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD5_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD5_GPIO_PIN 5U                       /*!<@brief PORTD pin index: 5 */
#define BOARD_INITPINS_PTD5_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD5_PIN 5U                            /*!<@brief PORTD pin index: 5 */
#define BOARD_INITPINS_PTD5_CHANNEL 5                         /*!<@brief GPIOD GPIO channel: 5 */
#define BOARD_INITPINS_PTD5_PIN_NAME PTD5                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD5_LABEL "PTD5"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD5_NAME "PTD5"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD5_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD6 (number 133), PTD6
  @{ */
#define BOARD_INITPINS_PTD6_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD6_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD6_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD6_GPIO_PIN 6U                       /*!<@brief PORTD pin index: 6 */
#define BOARD_INITPINS_PTD6_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD6_PIN 6U                            /*!<@brief PORTD pin index: 6 */
#define BOARD_INITPINS_PTD6_CHANNEL 6                         /*!<@brief GPIOD GPIO channel: 6 */
#define BOARD_INITPINS_PTD6_PIN_NAME PTD6                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD6_LABEL "PTD6"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD6_NAME "PTD6"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD6_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD7 (number 136), PTD7
  @{ */
#define BOARD_INITPINS_PTD7_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD7_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD7_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD7_GPIO_PIN 7U                       /*!<@brief PORTD pin index: 7 */
#define BOARD_INITPINS_PTD7_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD7_PIN 7U                            /*!<@brief PORTD pin index: 7 */
#define BOARD_INITPINS_PTD7_CHANNEL 7                         /*!<@brief GPIOD GPIO channel: 7 */
#define BOARD_INITPINS_PTD7_PIN_NAME PTD7                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD7_LABEL "PTD7"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD7_NAME "PTD7"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD7_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD8 (number 137), PTD8
  @{ */
#define BOARD_INITPINS_PTD8_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD8_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD8_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD8_GPIO_PIN 8U                       /*!<@brief PORTD pin index: 8 */
#define BOARD_INITPINS_PTD8_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD8_PIN 8U                            /*!<@brief PORTD pin index: 8 */
#define BOARD_INITPINS_PTD8_CHANNEL 8                         /*!<@brief GPIOD GPIO channel: 8 */
#define BOARD_INITPINS_PTD8_PIN_NAME PTD8                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD8_LABEL "PTD8"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD8_NAME "PTD8"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD8_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD9 (number 138), PTD9
  @{ */
#define BOARD_INITPINS_PTD9_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD9_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD9_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD9_GPIO_PIN 9U                       /*!<@brief PORTD pin index: 9 */
#define BOARD_INITPINS_PTD9_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD9_PIN 9U                            /*!<@brief PORTD pin index: 9 */
#define BOARD_INITPINS_PTD9_CHANNEL 9                         /*!<@brief GPIOD GPIO channel: 9 */
#define BOARD_INITPINS_PTD9_PIN_NAME PTD9                     /*!<@brief Pin name */
#define BOARD_INITPINS_PTD9_LABEL "PTD9"                      /*!<@brief Label */
#define BOARD_INITPINS_PTD9_NAME "PTD9"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD9_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD12 (number 141), PTD12
  @{ */
#define BOARD_INITPINS_PTD12_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD12_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD12_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD12_GPIO_PIN 12U                      /*!<@brief PORTD pin index: 12 */
#define BOARD_INITPINS_PTD12_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD12_PIN 12U                           /*!<@brief PORTD pin index: 12 */
#define BOARD_INITPINS_PTD12_CHANNEL 12                        /*!<@brief GPIOD GPIO channel: 12 */
#define BOARD_INITPINS_PTD12_PIN_NAME PTD12                    /*!<@brief Pin name */
#define BOARD_INITPINS_PTD12_LABEL "PTD12"                     /*!<@brief Label */
#define BOARD_INITPINS_PTD12_NAME "PTD12"                      /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD12_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                               /* @} */

/*! @name PORTD13 (number 142), PTD13
  @{ */
#define BOARD_INITPINS_PTD13_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_PTD13_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_PTD13_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_PTD13_GPIO_PIN 13U                      /*!<@brief PORTD pin index: 13 */
#define BOARD_INITPINS_PTD13_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD13_PIN 13U                           /*!<@brief PORTD pin index: 13 */
#define BOARD_INITPINS_PTD13_CHANNEL 13                        /*!<@brief GPIOD GPIO channel: 13 */
#define BOARD_INITPINS_PTD13_PIN_NAME PTD13                    /*!<@brief Pin name */
#define BOARD_INITPINS_PTD13_LABEL "PTD13"                     /*!<@brief Label */
#define BOARD_INITPINS_PTD13_NAME "PTD13"                      /*!<@brief Identifier name */
#define BOARD_INITPINS_PTD13_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                               /* @} */

/*! @name PORTB18 (number 97), EXPOSURE
  @{ */
#define BOARD_INITPINS_EXPOSURE_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_EXPOSURE_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_EXPOSURE_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_EXPOSURE_GPIO_PIN 18U                       /*!<@brief PORTB pin index: 18 */
#define BOARD_INITPINS_EXPOSURE_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_EXPOSURE_PIN 18U                            /*!<@brief PORTB pin index: 18 */
#define BOARD_INITPINS_EXPOSURE_CHANNEL 18                         /*!<@brief GPIOB GPIO channel: 18 */
#define BOARD_INITPINS_EXPOSURE_PIN_NAME PTB18                     /*!<@brief Pin name */
#define BOARD_INITPINS_EXPOSURE_LABEL "EXPOSURE"                   /*!<@brief Label */
#define BOARD_INITPINS_EXPOSURE_NAME "EXPOSURE"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_EXPOSURE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

