icboredman/TeensyCam-SW/board/pin_mux.h
/*! @name PORTB19 (number 98), STFRM_OUT
  @{ */
#define BOARD_INITPINS_STFRM_OUT_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_STFRM_OUT_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_STFRM_OUT_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_STFRM_OUT_GPIO_PIN 19U                       /*!<@brief PORTB pin index: 19 */
#define BOARD_INITPINS_STFRM_OUT_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_STFRM_OUT_PIN 19U                            /*!<@brief PORTB pin index: 19 */
#define BOARD_INITPINS_STFRM_OUT_CHANNEL 19                         /*!<@brief GPIOB GPIO channel: 19 */
#define BOARD_INITPINS_STFRM_OUT_PIN_NAME PTB19                     /*!<@brief Pin name */
#define BOARD_INITPINS_STFRM_OUT_LABEL "STFRM_OUT"                  /*!<@brief Label */
#define BOARD_INITPINS_STFRM_OUT_NAME "STFRM_OUT"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_STFRM_OUT_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTB10 (number 91), STLN_OUT1
  @{ */
#define BOARD_INITPINS_STLN_OUT1_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_STLN_OUT1_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_STLN_OUT1_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_STLN_OUT1_GPIO_PIN 10U                       /*!<@brief PORTB pin index: 10 */
#define BOARD_INITPINS_STLN_OUT1_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_STLN_OUT1_PIN 10U                            /*!<@brief PORTB pin index: 10 */
#define BOARD_INITPINS_STLN_OUT1_CHANNEL 10                         /*!<@brief GPIOB GPIO channel: 10 */
#define BOARD_INITPINS_STLN_OUT1_PIN_NAME PTB10                     /*!<@brief Pin name */
#define BOARD_INITPINS_STLN_OUT1_LABEL "STLN_OUT1"                  /*!<@brief Label */
#define BOARD_INITPINS_STLN_OUT1_NAME "STLN_OUT1"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_STLN_OUT1_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTB11 (number 92), STLN_OUT2
  @{ */
#define BOARD_INITPINS_STLN_OUT2_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_STLN_OUT2_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_STLN_OUT2_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_STLN_OUT2_GPIO_PIN 11U                       /*!<@brief PORTB pin index: 11 */
#define BOARD_INITPINS_STLN_OUT2_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_STLN_OUT2_PIN 11U                            /*!<@brief PORTB pin index: 11 */
#define BOARD_INITPINS_STLN_OUT2_CHANNEL 11                         /*!<@brief GPIOB GPIO channel: 11 */
#define BOARD_INITPINS_STLN_OUT2_PIN_NAME PTB11                     /*!<@brief Pin name */
#define BOARD_INITPINS_STLN_OUT2_LABEL "STLN_OUT2"                  /*!<@brief Label */
#define BOARD_INITPINS_STLN_OUT2_NAME "STLN_OUT2"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_STLN_OUT2_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTA5 (number 55), LNVAL1
  @{ */
#define BOARD_INITPINS_LNVAL1_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_LNVAL1_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_LNVAL1_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_LNVAL1_GPIO_PIN 5U                       /*!<@brief PORTA pin index: 5 */
#define BOARD_INITPINS_LNVAL1_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_LNVAL1_PIN 5U                            /*!<@brief PORTA pin index: 5 */
#define BOARD_INITPINS_LNVAL1_CHANNEL 5                         /*!<@brief GPIOA GPIO channel: 5 */
#define BOARD_INITPINS_LNVAL1_PIN_NAME PTA5                     /*!<@brief Pin name */
#define BOARD_INITPINS_LNVAL1_LABEL "LNVAL1"                    /*!<@brief Label */
#define BOARD_INITPINS_LNVAL1_NAME "LNVAL1"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_LNVAL1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTA14 (number 66), FRVAL1
  @{ */
#define BOARD_INITPINS_FRVAL1_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_FRVAL1_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_FRVAL1_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_FRVAL1_GPIO_PIN 14U                      /*!<@brief PORTA pin index: 14 */
#define BOARD_INITPINS_FRVAL1_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_FRVAL1_PIN 14U                           /*!<@brief PORTA pin index: 14 */
#define BOARD_INITPINS_FRVAL1_CHANNEL 14                        /*!<@brief GPIOA GPIO channel: 14 */
#define BOARD_INITPINS_FRVAL1_PIN_NAME PTA14                    /*!<@brief Pin name */
#define BOARD_INITPINS_FRVAL1_LABEL "FRVAL1"                    /*!<@brief Label */
#define BOARD_INITPINS_FRVAL1_NAME "FRVAL1"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_FRVAL1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTA15 (number 67), PIXCLK1
  @{ */
#define BOARD_INITPINS_PIXCLK1_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_PIXCLK1_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_PIXCLK1_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_PIXCLK1_GPIO_PIN 15U                      /*!<@brief PORTA pin index: 15 */
#define BOARD_INITPINS_PIXCLK1_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_PIXCLK1_PIN 15U                           /*!<@brief PORTA pin index: 15 */
#define BOARD_INITPINS_PIXCLK1_CHANNEL 15                        /*!<@brief GPIOA GPIO channel: 15 */
#define BOARD_INITPINS_PIXCLK1_PIN_NAME PTA15                    /*!<@brief Pin name */
#define BOARD_INITPINS_PIXCLK1_LABEL "PIXCLK1"                   /*!<@brief Label */
#define BOARD_INITPINS_PIXCLK1_NAME "PIXCLK1"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_PIXCLK1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTA28 (number 79), LNVAL2
  @{ */
#define BOARD_INITPINS_LNVAL2_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_LNVAL2_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_LNVAL2_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_LNVAL2_GPIO_PIN 28U                      /*!<@brief PORTA pin index: 28 */
#define BOARD_INITPINS_LNVAL2_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_LNVAL2_PIN 28U                           /*!<@brief PORTA pin index: 28 */
#define BOARD_INITPINS_LNVAL2_CHANNEL 28                        /*!<@brief GPIOA GPIO channel: 28 */
#define BOARD_INITPINS_LNVAL2_PIN_NAME PTA28                    /*!<@brief Pin name */
#define BOARD_INITPINS_LNVAL2_LABEL "LNVAL2"                    /*!<@brief Label */
#define BOARD_INITPINS_LNVAL2_NAME "LNVAL2"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_LNVAL2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                /* @} */

