icboredman/TeensyCam-SW/board/pin_mux.h
/*! @name PORTA29 (number 80), FRVAL2
  @{ */
#define BOARD_INITPINS_FRVAL2_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_FRVAL2_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_FRVAL2_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_FRVAL2_GPIO_PIN 29U                      /*!<@brief PORTA pin index: 29 */
#define BOARD_INITPINS_FRVAL2_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_FRVAL2_PIN 29U                           /*!<@brief PORTA pin index: 29 */
#define BOARD_INITPINS_FRVAL2_CHANNEL 29                        /*!<@brief GPIOA GPIO channel: 29 */
#define BOARD_INITPINS_FRVAL2_PIN_NAME PTA29                    /*!<@brief Pin name */
#define BOARD_INITPINS_FRVAL2_LABEL "FRVAL2"                    /*!<@brief Label */
#define BOARD_INITPINS_FRVAL2_NAME "FRVAL2"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_FRVAL2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTA26 (number 77), PIXCLK2
  @{ */
#define BOARD_INITPINS_PIXCLK2_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_PIXCLK2_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_PIXCLK2_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_PIXCLK2_GPIO_PIN 26U                      /*!<@brief PORTA pin index: 26 */
#define BOARD_INITPINS_PIXCLK2_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_PIXCLK2_PIN 26U                           /*!<@brief PORTA pin index: 26 */
#define BOARD_INITPINS_PIXCLK2_CHANNEL 26                        /*!<@brief GPIOA GPIO channel: 26 */
#define BOARD_INITPINS_PIXCLK2_PIN_NAME PTA26                    /*!<@brief Pin name */
#define BOARD_INITPINS_PIXCLK2_LABEL "PIXCLK2"                   /*!<@brief Label */
#define BOARD_INITPINS_PIXCLK2_NAME "PIXCLK2"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_PIXCLK2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
